app/controllers/animals_controller.rb

  def show
    @animal = Animal.find(params[:id])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", "1"]]

  def new
    @animal = Animal.new
    @especies = Especie.all
    @instituicoes = Instituicao.all
---
SELECT "especies".* FROM "especies"
SELECT "instituicaos".* FROM "instituicaos"

  def edit
    @animal = Animal.find(params[:id])
    @especies = Especie.all
    @instituicoes = Instituicao.all
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "especies".* FROM "especies"
SELECT "instituicaos".* FROM "instituicaos"

  def create
    @animal = Animal.new(params[:animal])

    respond_to do |format|
      if @animal.save
---
INSERT INTO "animals" ("created_at", "descricao", "especie_id", "foto_content_type", "foto_file_name", "foto_file_size", "foto_updated_at", "idade", "instituicao_id", "pelagem", "raca", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    @animal = Animal.find(params[:id])

    respond_to do |format|
      if @animal.update_attributes(params[:animal])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "animals" SET "foto_file_name" = 'imgres.jpg', "foto_content_type" = 'image/jpeg', "foto_file_size" = 6774, "foto_updated_at" = '2013-03-07 20:45:14.349875', "updated_at" = '2013-03-07 20:45:22.481340' WHERE "animals"."id" = 1

  def destroy
    @animal = Animal.find(params[:id])
    @animal.destroy
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 3]]