app/controllers/coletamaterials_controller.rb

SELECT "coletamaterials".* FROM "coletamaterials"
---
  def index
    @coletamaterials = Coletamaterial.all