app/controllers/especies_controller.rb

SELECT "especies".* FROM "especies"
---
  def index
    @especies = Especie.all

SELECT "especies".* FROM "especies" WHERE "especies"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @especy = Especie.find(params[:id])

SELECT "especies".* FROM "especies" WHERE "especies"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @especy = Especie.find(params[:id])

INSERT INTO "especies" ("created_at", "descricao", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 06 Feb 2013 12:00:12 UTC +00:00], ["descricao", nil], ["updated_at", Wed, 06 Feb 2013 12:00:12 UTC +00:00]]
---
  def create
    @especy = Especie.new(params[:especy])

    respond_to do |format|
      if @especy.save

SELECT "especies".* FROM "especies" WHERE "especies"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def update
    @especy = Especie.find(params[:id])

SELECT "especies".* FROM "especies" WHERE "especies"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "especies" WHERE "especies"."id" = $1  [["id", 1]]
---
  def destroy
    @especy = Especie.find(params[:id])
    @especy.destroy