app/controllers/eventos_controller.rb

  def index
    @eventos = Evento.all
---
SELECT "eventos".* FROM "eventos"

  def show
    @evento = Evento.find(params[:id])
---
SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT 1  [["id", "1"]]

  def new
    @evento = Evento.new
    @instituicoes = Instituicao.all
---
SELECT "instituicaos".* FROM "instituicaos"

  def edit
    @evento = Evento.find(params[:id])
    @instituicoes = Instituicao.all
---
SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "instituicaos".* FROM "instituicaos"

  def create
    @evento = Evento.new(params[:evento])

    respond_to do |format|
      if @evento.save
---
INSERT INTO "eventos" ("created_at", "data", "descricao", "horario", "instituicao_id", "local", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @evento = Evento.find(params[:id])

    respond_to do |format|
      if @evento.update_attributes(params[:evento])
---
SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "eventos" SET "local" = 'holywood', "descricao" = 'evento novo', "foto_file_name" = 'Hollywood.jpg', "foto_content_type" = 'image/jpeg', "foto_file_size" = 262701, "foto_updated_at" = '2013-03-24 20:49:02.524254', "updated_at" = '2013-03-24 20:49:05.990453' WHERE "eventos"."id" = 2