app/controllers/instituicaos_controller.rb

SELECT "instituicaos".* FROM "instituicaos"
---
  def index
    @instituicaos = Instituicao.all

SELECT "instituicaos".* FROM "instituicaos" WHERE "instituicaos"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @instituicao = Instituicao.find(params[:id])

SELECT "instituicaos".* FROM "instituicaos" WHERE "instituicaos"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."instituicao_id" = 1 LIMIT 1
---
  def edit
    @instituicao = Instituicao.find(params[:id])
    @endereco = Endereco.find(@instituicao.endereco.id)

INSERT INTO "instituicaos" ("cnpj", "created_at", "email", "endereco_id", "login", "nome", "senha", "telefone", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @instituicao = Instituicao.new(params[:instituicao])
    respond_to do |format|
      if @instituicao.save

SELECT "instituicaos".* FROM "instituicaos" WHERE "instituicaos"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "instituicaos" SET "nome" = 'asdfasdfasdf', "endereco_id" = 3, "updated_at" = '2013-03-23 21:13:28.185753' WHERE "instituicaos"."id" = 3
---
  def update
    @instituicao = Instituicao.find(params[:id])

    respond_to do |format|
      if @instituicao.update_attributes(params[:instituicao])

SELECT "instituicaos".* FROM "instituicaos" WHERE "instituicaos"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "instituicaos" WHERE "instituicaos"."id" = $1  [["id", 3]]
---
  def destroy
    @instituicao = Instituicao.find(params[:id])
    @instituicao.destroy